УТ_для_edt/src/Documents/смартУстановкаИндивидуальныхСкидокКлиентов/смартУстановкаИндивидуальныхСкидокКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартУстановкаИндивидуальныхСкидокКлиентов</name>
  <comment>#1323 смарт: Лопато 21.09.2023 //Восстановить и переделать механизм индивидуальных скидок</comment>
  <registerRecords>InformationRegister.смартИндивидуальныеСкидкиКлиентов</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Клиенты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДействия</name>
      <comment>#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокДействия</name>
      <comment>#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/смартИндивидуальныеСкидкиКлиентов/смартИндивидуальныеСкидкиКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартИндивидуальныеСкидкиКлиентов</name>
  <comment>#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПроцентСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <comment>#1870 смарт: Лопато 24.06.2024 //Доработать механизм выгрузки индивидуальных скидок</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Documents/смартУстановкаИндивидуальныхСкидокКлиентов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область Проведение

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт

	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ИнициализироватьТаблицуСкидок(Запрос, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры

Процедура ИнициализироватьТаблицуСкидок(Запрос, Регистры) Экспорт

	ИмяРегистра = "смартИндивидуальныеСкидкиКлиентов";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСкидок = Новый Массив;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ТЧСкидки.НачалоДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТЧСкидки.Ссылка.Дата
		|		ИНАЧЕ ТЧСкидки.НачалоДействия
		|	КОНЕЦ КАК Период,
		|	ТЧСкидки.СрокДействия КАК СрокДействия,
		|	ТЧСкидки.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ТЧСкидки.ПроцентСкидки) КАК ПроцентСкидки,
		|	ТЧСкидки.Ссылка.Ответственный КАК Ответственный
		|ПОМЕСТИТЬ ВТ_ТЧСкидки
		|ИЗ
		|	Документ.смартУстановкаИндивидуальныхСкидокКлиентов.Скидки КАК ТЧСкидки
		|ГДЕ
		|	ТЧСкидки.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ТЧСкидки.НачалоДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТЧСкидки.Ссылка.Дата
		|		ИНАЧЕ ТЧСкидки.НачалоДействия
		|	КОНЕЦ,
		|	ТЧСкидки.СрокДействия,
		|	ТЧСкидки.Номенклатура,
		|	ТЧСкидки.Ссылка.Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Клиент КАК Клиент
		|ПОМЕСТИТЬ ТЧ_Клиенты
		|ИЗ
		|	Документ.смартУстановкаИндивидуальныхСкидокКлиентов.Клиенты
		|ГДЕ
		|	Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ТЧСкидки.Период КАК Период,
		|	ВТ_ТЧСкидки.СрокДействия КАК СрокДействия,
		|	ТЧ_Клиенты.Клиент КАК Клиент,
		|	ВТ_ТЧСкидки.Номенклатура КАК Номенклатура,
		|	ВТ_ТЧСкидки.ПроцентСкидки КАК ПроцентСкидки,
		|	ВТ_ТЧСкидки.Ответственный КАК Ответственный
		|ПОМЕСТИТЬ ВТ_ДокСкидки
		|ИЗ
		|	ТЧ_Клиенты КАК ТЧ_Клиенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТЧСкидки КАК ВТ_ТЧСкидки
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВТ_ТЧСкидки.Номенклатура ЕСТЬ NULL	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ИндСкидки.Период, НАЧАЛОПЕРИОДА(ВТ_ДокСкидки.Период, ДЕНЬ)), СЕКУНДА, 1)) КАК Период,
		|	ВТ_ДокСкидки.Клиент КАК Клиент,
		|	ВТ_ДокСкидки.Номенклатура КАК Номенклатура,
		|	ВТ_ДокСкидки.ПроцентСкидки КАК ПроцентСкидки,
		|	ВТ_ДокСкидки.Ответственный КАК Ответственный,
		|	ВТ_ДокСкидки.СрокДействия КАК СрокДействия
		|ИЗ
		|	ВТ_ДокСкидки КАК ВТ_ДокСкидки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартИндивидуальныеСкидкиКлиентов КАК ИндСкидки
		|		ПО (ИндСкидки.Регистратор <> &Ссылка)
		|			И ВТ_ДокСкидки.Номенклатура = ИндСкидки.Номенклатура
		|			И ВТ_ДокСкидки.Клиент = ИндСкидки.Клиент
		|			И (НАЧАЛОПЕРИОДА(ИндСкидки.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ВТ_ДокСкидки.Период, ДЕНЬ))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДокСкидки.Период,
		|	ВТ_ДокСкидки.Клиент,
		|	ВТ_ДокСкидки.Номенклатура,
		|	ВТ_ДокСкидки.ПроцентСкидки,
		|	ВТ_ДокСкидки.Ответственный,
		|	ВТ_ДокСкидки.СрокДействия
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ИндСкидки.Период, НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТ_ДокСкидки.СрокДействия, ДЕНЬ, 1), ДЕНЬ)), СЕКУНДА, 1)),
		|	ВТ_ДокСкидки.Клиент,
		|	ВТ_ДокСкидки.Номенклатура,
		|	0,
		|	ВТ_ДокСкидки.Ответственный,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	ВТ_ДокСкидки КАК ВТ_ДокСкидки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартИндивидуальныеСкидкиКлиентов КАК ИндСкидки
		|		ПО (ИндСкидки.Регистратор <> &Ссылка)
		|			И ВТ_ДокСкидки.Номенклатура = ИндСкидки.Номенклатура
		|			И ВТ_ДокСкидки.Клиент = ИндСкидки.Клиент
		|			И (НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ИндСкидки.Период, ДЕНЬ, 1), ДЕНЬ) = НАЧАЛОПЕРИОДА(ВТ_ДокСкидки.СрокДействия, ДЕНЬ))
		|ГДЕ
		|	ВТ_ДокСкидки.СрокДействия <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДокСкидки.СрокДействия,
		|	ВТ_ДокСкидки.Клиент,
		|	ВТ_ДокСкидки.Номенклатура,
		|	ВТ_ДокСкидки.Ответственный
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	Номенклатура,
		|	Период
		|АВТОУПОРЯДОЧИВАНИЕ";

	РезультатЗапроса = Запрос.Выполнить();

	Регистры.Вставить("Таблица" + ИмяРегистра, РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
